CREATE TABLE IF NOT EXISTS `meeting_application` (
  `id` INT NOT NULL AUTO_INCREMENT,
  `applicant` VARCHAR(100) NOT NULL,
  `room` VARCHAR(255) NOT NULL,
  `startTime` DATETIME NOT NULL,
  `endTime` DATETIME NOT NULL,
  `attendees` INT NOT NULL,
  `meetingName` VARCHAR(255) NOT NULL,
  `branchLeaders` VARCHAR(255) DEFAULT '',
  `status` ENUM('确认', '取消', '待审批') DEFAULT '确认',
  `submitTime` DATETIME NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

INSERT INTO `meeting_application` (`id`, `applicant`, `room`, `startTime`, `endTime`, `attendees`, `meetingName`, `branchLeaders`, `status`, `submitTime`) VALUES
(9419, '滕晓龙', '01号楼二楼会议室', '2024-05-15 08:00:00', '2024-05-15 17:00:00', 60, '全重实验室年会', '', '确认', '2024-04-02 08:44:00'),
(9458, '滕晓龙', '01号楼二楼会议室', '2024-05-13 13:00:00', '2024-05-13 17:00:00', 60, '“科学与中国——双千报告”', '', '确认', '2024-04-22 15:46:00'),
(9455, '朱泰来', '11号楼二楼会议室', '2024-04-30 13:00:00', '2024-04-30 17:00:00', 20, '青咖沙龙', '', '确认', '2024-04-21 16:50:00'),
(9465, '滕晓龙', '01号楼二楼会议室', '2024-04-30 13:00:00', '2024-04-30 17:00:00', 10, '基础局工作会议', '', '确认', '2024-04-27 12:06:00'),
(9466, '滕晓龙', '01号楼一楼会议室', '2024-04-30 13:00:00', '2024-04-30 17:00:00', 10, '基础局工作会议', '', '确认', '2024-04-27 12:08:00'),
(9468, '陈寅', '11号楼一楼会议室', '2024-04-29 13:00:00', '2024-04-29 17:00:00', 20, '览岳沙龙', '', '确认', '2024-04-27 15:22:00'),
(9472, '陈寅', '22号楼201会议室', '2024-04-29 09:00:00', '2024-04-29 12:00:00', 10, '科技合作处工作交流', '', '确认', '2024-04-28 11:22:00'),
(9469, '陈寅', '11号楼二楼会议室', '2024-04-29 08:00:00', '2024-04-29 17:00:00', 20, '先导专项汇报', '', '取消', '2024-04-27 15:32:00'),
(9470, '陈寅', '01号楼二楼会议室', '2024-04-29 08:00:00', '2024-04-29 17:00:00', 20, '先导B项目汇报', '', '确认', '2024-04-27 16:17:00'),
(9473, '薛芳', '22号楼201会议室', '2024-04-28 14:30:00', '2024-04-28 17:00:00', 5, '支部会', '', '确认', '2024-04-28 11:25:00'),
(9471, '陈寅', '22号楼504会议室', '2024-04-28 09:00:00', '2024-04-28 12:00:00', 7, '科技处工作会议', '', '确认', '2024-04-27 20:17:00'),
(9447, '杜奇', '22号楼504会议室', '2024-04-28 09:00:00', '2024-04-28 11:30:00', 25, '中国科学院上海分院-兰州分院资产管理工作交流会', '', '取消', '2024-04-17 14:03:00'),
(9454, '王晓霞', '01号楼二楼会议室', '2024-04-28 08:00:00', '2024-04-28 11:00:00', 50, '上海分院、兰州分院资产管理工作交流会', '', '确认', '2024-04-21 15:01:00'),
(9464, '薛芳', '22号楼201会议室', '2024-04-28 08:00:00', '2024-04-28 11:00:00', 6, '技能大赛筹备会', '', '确认', '2024-04-27 10:27:00'),
(9467, '居文君', '22号楼301会议室', '2024-04-27 14:00:00', '2024-04-27 17:00:00', 3, '五四大会讨论', '', '确认', '2024-04-27 13:21:00');
